pyocd/pyOCD/pyocd/debug/svd/data/MKE15Z7.svd
        <register>
          <name>SSC0</name>
          <description>TSI SSC Register 0</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x60320000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSC_PRESCALE_NUM</name>
              <description>SSC_PRESCALE_NUM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00000000</name>
                  <description>div2(2^0*2)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000001</name>
                  <description>div4(2^1*2)</description>
                  <value>#1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000011</name>
                  <description>div8(2^2*2)</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111</name>
                  <description>div16(2^3*2)</description>
                  <value>#111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00001111</name>
                  <description>div32(2^4*2)</description>
                  <value>#1111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00011111</name>
                  <description>div64(2^5*2)</description>
                  <value>#11111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00111111</name>
                  <description>div128(2^6*2)</description>
                  <value>#111111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01111111</name>
                  <description>div256(2^7*2)</description>
                  <value>#1111111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11111111</name>
                  <description>div512(2^8*2)</description>
                  <value>#11111111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BASE_NOCHARGE_NUM</name>
              <description>BASE_NOCHARGE_NUM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>The SSC output bit 1&apos;s basic period will be 1 clock cycle of system clock.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>The SSC output bit 1&apos;s basic period will be 2 clock cycles of system clock.</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>The SSC output bit 1&apos;s basic period will be 3 clock cycles of system clock.</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>The SSC output bit 1&apos;s basic period will be 4 clock cycles of system clock.</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>The SSC output bit 1&apos;s basic period will be 5 clock cycles of system clock.</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>The SSC output bit 1&apos;s basic period will be 6 clock cycles of system clock.</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>The SSC output bit 1&apos;s basic period will be 7 clock cycles of system clock.</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>The SSC output bit 1&apos;s basic period will be 8 clock cycles of system clock.</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>The SSC output bit 1&apos;s basic period will be 9 clock cycles of system clock.</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>The SSC output bit 1&apos;s basic period will be 10 clock cycles of system clock.</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>The SSC output bit 1&apos;s basic period will be 11 clock cycles of system clock.</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>The SSC output bit 1&apos;s basic period will be 12 clock cycles of system clock.</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>The SSC output bit 1&apos;s basic period will be 13 clock cycles of system clock.</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>The SSC output bit 1&apos;s basic period will be 14 clock cycles of system clock.</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>The SSC output bit 1&apos;s basic period will be 15 clock cycles of system clock.</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>The SSC output bit 1&apos;s basic period will be 16 clock cycles of system clock.</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHARGE_NUM</name>
              <description>CHARGE_NUM</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>The SSC output bit 0&apos;s period will be 1 clock cycle of system clock.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>The SSC output bit 0&apos;s period will be 2 clock cycles of system clock.</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>The SSC output bit 0&apos;s period will be 3 clock cycles of system clock.</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>The SSC output bit 0&apos;s period will be 4 clock cycles of system clock.</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>The SSC output bit 0&apos;s period will be 5 clock cycles of system clock.</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>The SSC output bit 0&apos;s period will be 6 clock cycles of system clock.</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>The SSC output bit 0&apos;s period will be 7 clock cycles of system clock.</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>The SSC output bit 0&apos;s period will be 8 clock cycles of system clock.</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>The SSC output bit 0&apos;s period will be 9 clock cycles of system clock.</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>The SSC output bit 0&apos;s period will be 10 clock cycles of system clock.</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>The SSC output bit 0&apos;s period will be 11 clock cycles of system clock.</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>The SSC output bit 0&apos;s period will be 12 clock cycles of system clock.</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>The SSC output bit 0&apos;s period will be 13 clock cycles of system clock.</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>The SSC output bit 0&apos;s period will be 14 clock cycles of system clock.</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>The SSC output bit 0&apos;s period will be 15 clock cycles of system clock.</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>The SSC output bit 0&apos;s period will be 16 clock cycles of system clock.</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSC_CONTROL_REVERSE</name>
              <description>SSC_CONTROL_REVERSE</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Keep the polarity of the SSC output bit.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Reverse the polarity of the SSC output bit.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSC_MODE</name>
              <description>SSC_MODE</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Using PRBS method generating SSC output bit.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Using up-down counter generating SSC output bit.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>SSC function is disabled.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>NC.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRBS_OUTSEL</name>
              <description>PRBS_OUTSEL</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>NC.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>NC.</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>The length of the PRBS is 2.</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>The length of the PRBS is 3.</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>The length of the PRBS is 4.</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>The length of the PRBS is 5.</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>The length of the PRBS is 6.</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>The length of the PRBS is 7.</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>The length of the PRBS is 8.</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>The length of the PRBS is 9.</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>The length of the PRBS is 10.</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>The length of the PRBS is 11.</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>The length of the PRBS is 12.</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>The length of the PRBS is 13.</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>The length of the PRBS is 14.</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>The length of the PRBS is 15.</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSC1</name>
          <description>TSI SSC Register 0</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x600040</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRBS_SEED_LO</name>
              <description>PRBS_SEED_LO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRBS_SEED_HI</name>
              <description>PRBS_SEED_HI</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRBS_WEIGHT_LO</name>
              <description>PRBS_WEIGHT_LO</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRBS_WEIGHT_HI</name>
              <description>PRBS_WEIGHT_HI</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
