pyocd/pyOCD/pyocd/debug/svd/data/MKE15Z7.svd
        <register>
          <name>SSC2</name>
          <description>TSI SSC Register 2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10080101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MOVE_REPEAT_NUM</name>
              <description>MOVE_REPEAT_NUM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00000</name>
                  <description>The up_down counter will be updated for every sample-charge cycle.</description>
                  <value>#00000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00001</name>
                  <description>The up_down counter will be updated for every 2 sample-charge cycles.</description>
                  <value>#00001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00010</name>
                  <description>The up_down counter will be updated for every 3 sample-charge cycles.</description>
                  <value>#00010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00011</name>
                  <description>The up_down counter will be updated for every 4 sample-charge cycles.</description>
                  <value>#00011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00100</name>
                  <description>The up_down counter will be updated for every 5 sample-charge cycles.</description>
                  <value>#00100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00101</name>
                  <description>The up_down counter will be updated for every 6 sample-charge cycles.</description>
                  <value>#00101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00110</name>
                  <description>The up_down counter will be updated for every 7 sample-charge cycles.</description>
                  <value>#00110</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOVE_STEPS_NUM</name>
              <description>MOVE_STEPS_NUM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>The added value for up-down counter is 0.</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>The added value for up-down counter is 1.</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>The added value for up-down counter is 2.</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>The added value for up-down counter is 3.</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>The added value for up-down counter is 4.</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>The added value for up-down counter is 5.</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>The added value for up-down counter is 6.</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>The added value for up-down counter is 7.</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOVE_NOCHARGE_MAX</name>
              <description>MOVE_NOCHARGE_MAX</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOVE_NOCHARGE_MIN</name>
              <description>MOVE_NOCHARGE_MIN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>The SSC output bit 1&apos;s min period will be (1 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycle of system clock.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>The SSC output bit 1&apos;s min period will be (2 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>The SSC output bit 1&apos;s min period will be (3 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>The SSC output bit 1&apos;s min period will be (4 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>The SSC output bit 1&apos;s min period will be (5 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>The SSC output bit 1&apos;s min period will be (6 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>The SSC output bit 1&apos;s min period will be (7 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>The SSC output bit 1&apos;s min period will be (8 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>The SSC output bit 1&apos;s min period will be (9 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>The SSC output bit 1&apos;s min period will be (10 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>The SSC output bit 1&apos;s min period will be (11 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>The SSC output bit 1&apos;s min period will be (12 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>The SSC output bit 1&apos;s min period will be (13 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>The SSC output bit 1&apos;s min period will be (14 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>The SSC output bit 1&apos;s min period will be (15 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>The SSC output bit 1&apos;s min period will be (16 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock.</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
