pyocd/pyOCD/pyocd/debug/svd/data/MKE15Z7.svd
        <register>
          <name>LPFLLTCFG</name>
          <description>Low Power FLL Trim Configuration Register</description>
          <addressOffset>0x50C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIMSRC</name>
              <description>Trim Source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>SIRC</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>FIRC</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>System OSC</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>RTC OSC</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIMDIV</name>
              <description>LPFLL Trim Predivide</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKW2LSB</name>
              <description>Lock LPFLL with 2 LSBS</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>LPFLL locks within 1LSB (0.4%)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>LPFLL locks within 2LSB (0.8%)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPFLLSTAT</name>
          <description>Low Power FLL Status Register</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUTOTRIM</name>
              <description>Auto Tune Trim Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PCC</name>
      <description>PCC</description>
      <baseAddress>0x40065000</baseAddress>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1B4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PCC_DMA0</name>
          <description>PCC Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INUSE</name>
              <description>Clock Gate Control</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Peripheral is not being used.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Peripheral is being used. Software cannot modify the existing clocking configuration.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGC</name>
              <description>Clock Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Clock disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Clock enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Peripheral is not present.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Peripheral is present.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCC_FLASH</name>
          <description>PCC Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INUSE</name>
              <description>Clock Gate Control</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Peripheral is not being used.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Peripheral is being used. Software cannot modify the existing clocking configuration.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGC</name>
              <description>Clock Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Clock disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Clock enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Peripheral is not present.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Peripheral is present.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCC_DMAMUX0</name>
          <description>PCC Register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INUSE</name>
              <description>Clock Gate Control</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Peripheral is not being used.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Peripheral is being used. Software cannot modify the existing clocking configuration.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGC</name>
              <description>Clock Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Clock disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Clock enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Peripheral is not present.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Peripheral is present.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCC_ADC1</name>
          <description>PCC Register</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCS</name>
              <description>Peripheral Clock Source Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>Clock is off (or test clock is enabled).</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>OSCCLK - System Oscillator Bus Clock(scg_sosc_slow_clk).</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>SCGIRCLK - Slow IRC Clock(scg_sirc_slow_clk), (maximum is 8MHz).</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>SCGFIRCLK - Fast IRC Clock(scg_firc_slow_clk), (maximum is 48MHz).</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>SCGPCLK System PLL clock(scg_spll_slow_clk).</description>
                  <value>#110</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INUSE</name>
              <description>Clock Gate Control</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Peripheral is not being used.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Peripheral is being used. Software cannot modify the existing clocking configuration.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGC</name>
              <description>Clock Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Clock disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Clock enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Peripheral is not present.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Peripheral is present.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCC_LPSPI0</name>
          <description>PCC Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCS</name>
              <description>Peripheral Clock Source Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>Clock is off (or test clock is enabled).</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>OSCCLK - System Oscillator Bus Clock(scg_sosc_slow_clk).</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>SCGIRCLK - Slow IRC Clock(scg_sirc_slow_clk), (maximum is 8MHz).</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>SCGFIRCLK - Fast IRC Clock(scg_firc_slow_clk), (maximum is 48MHz).</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>SCGPCLK System PLL clock(scg_spll_slow_clk).</description>
                  <value>#110</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INUSE</name>
              <description>Clock Gate Control</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Peripheral is not being used.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Peripheral is being used. Software cannot modify the existing clocking configuration.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGC</name>
              <description>Clock Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Clock disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Clock enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Peripheral is not present.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Peripheral is present.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCC_LPSPI1</name>
          <description>PCC Register</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCS</name>
              <description>Peripheral Clock Source Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>Clock is off (or test clock is enabled).</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>OSCCLK - System Oscillator Bus Clock(scg_sosc_slow_clk).</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>SCGIRCLK - Slow IRC Clock(scg_sirc_slow_clk), (maximum is 8MHz).</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>SCGFIRCLK - Fast IRC Clock(scg_firc_slow_clk), (maximum is 48MHz).</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>SCGPCLK System PLL clock(scg_spll_slow_clk).</description>
                  <value>#110</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INUSE</name>
              <description>Clock Gate Control</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Peripheral is not being used.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Peripheral is being used. Software cannot modify the existing clocking configuration.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGC</name>
              <description>Clock Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Clock disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Clock enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Peripheral is not present.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Peripheral is present.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
